# 5)შექმენით რიცხვების სია სადაც იქნება 5 რიცხვი, შემდეგ მომხმარებელს შემოატანინეთ მისი საყვარელი რიცხვი და ასევე ინდექსი,
# საბოლოოდ ამ შემოტანილ ინდექსზე ჩაამატეთ მისი საყვარელი რიცხვი (შეამოწმეთ რომ ინდექსი იყოს ვალიდური
# (ანუ არ უნდა ცდებოდეს სიის ინდექსებს (მაგ: თუ სიაში არის მაქსიმალური ინდექსი 5 და მომხმარებელმა შემოიტანა 100,
# მაშინ დაუპრინტეთ invalid index)))

numbers = [1,2,3,4,5]
number = input('enter your number: ')
index = input('enter your index: ')
if index >= 0 and index < len(numbers):
    numbers.insert(index,number)
else:
    print("invalid index")