# მოიძიეთ ინფორმაცია if else statement - ების შესახებ პითონში, შექმენით ერთი ცვლადი მასში შეინახეთ რაიმე რიცხვი
# თქვენი დავალებაა რომ შეამოწმოთ იმ შემთხვევაში თუ რიცხვი უნაშთოდ იყოფა 2 - ზე გამოიტანეთ რომ The number is even 
# სხვა შემთხვევაში კი The number is odd იმისათვის რომ შეამოწმოთ იყოფა თუ არა რიცხვი უნაშთოდ ორზე გამოიყენეთ % პროცენტული გაყოფა

number = 24   # გავაკეთოთ ცვლადი და ჩავწეროთ რიცხვი 24

if number % 2 == 0: # ვამოწმებთ — იყოფა თუ არა რიცხვი უნაშთოდ 2-ზე
   print("the number is even") # თუ პირობა მართალია ეს ხაზი შესრულდება

else:
   print("The number is odd") # თუ პირობა არ არის მართალი შესრულდება ეს ხაზი

# გავაკეთოთ კიდევ ერთი რომ კარგად გავიაზროთ

number = 7   # გავაკეთოთ ცვლადი და ჩავწეროთ რიცხვი 7

if number % 2 == 0:               # ვამოწმებთ — იყოფა თუ არა რიცხვი უნაშთოდ 2-ზე
    print("the number is even")   # თუ პირობა მართალია ეს ხაზი შესრულდება
else:
    print("The number is odd")    # თუ პირობა არ არის მართალი შესრულდება ეს ხაზი