# 2)შექმენით 8 ცვლადი სადაც შეინახავთ ყველა შესაძლო ლოგიკური ოპერატორის მაგალითს (4 ცალი or / 4 ცალი and)

# როდესაც ვიყენებთ "or" ოპერატორს რუ პირობაში ერთი მაინც არის მართალი
# აუცილებლად ტერმინალში გამოგვიტანს true-ს ხოლო თუ ორივე იქნება არასწორი გამოგვიტანს false-ს

print(10 > 8 or 10 < 88 )
print(10 >= 16 or 10 > 88)
print(False or False)
print(True or False)


# თუ and ოპერატორში ერთი პირობა მაინცაა მაინც არის არასწორი
#  გამოგვიტანს false-ს ხოლო თუ ორივე პირობა მართალი აგამოგვიტანს true-ს

print(False and True)
print(True and True)
print(10 > 9 and 11 >= 10)
print(144 > 12 and 169 < 14)