#მონაცემთა ტიპი აღნიშნავს თუ რა ტიპის ინფორმაციაა ცვლადშიი და როგორ უნდა გამოვიყრნოთ ის აი მაგალითად:
#int-მთელი რიცხვი
#string-ტექსტური შეტყობინება
#float-ათწილადი რიცხვი
#list-სილა მაგალითად: (1, 2, 3,)
#bool-მაგალითად (true or fulse

#მონაცემთა ტიპი აღნიშნავს თუ რა ტიპის ინფორმაციაა ცვლადშიი და როგორ უნდა გამოვიყრნოთ ის აი მაგალითად:
#int-მთელი რიცხვი
#string-ტექსტური შეტყობინება
#float-ათწილადი რიცხვი
#list-სილა მაგალითად: (1, 2, 3,)
#bool-მაგალითად (true or fulse



#კომპიუტერი ჩვენს დაწერილ კოდს კითხულობს პრპბითი სისტეის საშუალებიტ რომელიც შედგება 0ებისგან და 1ებისგან მას არესმის არააირი პროგრამირების ენა