# თქვენი სიტყვებით ახსენით თუ რა არის Debugging, თქვენი აზრით რაში ვიყენებთ ჩვენ მას, კარგად გაიაზრეთ. 
# გადახედეთ ქვემოთ მოცემულ კოდს და ახსენით თუ რატომ გამოიწვევს ის error - ს

# debugging არის ის წყარო რომლითაც შეგვიძლია ვნახოთ თ რაშეცდომებია კოდში

my_name = "Your name"
print(my_name)

# მოცემულ კოდში გვიჩვენებს error-ს რადგან პითონში კოდი იკითხება ზემოდან ქვემოთ და საჭროა რომ
# ჯერ შევქმნათ ცვლადი და ამის შემდეგ დავპრინტოთ იგი გარდა ამისა როდესაც ჩვენ ვწერთ string-ს საჭიროა რომ ორივე მხარეს იყოს ბრჭყალები